import { FC } from 'react'
import styles from './AccessabiityStatement.module.scss'
import Button from '../buttons/button/Button'
import { ButtonType } from '../../../model/enumsModel'

interface Props {
    close: () => void
}

const AccessabilityStatement:FC<Props> = ({close}) => {
    return (
        <div className={styles.acc}>
            <section>

                <h1>הצהרת נגישות</h1>
                <p>
                    אנו בחברת פרידי הסכמות בע"מ פועלים רבות על מנת להנגיש את פורטל האינטרנט שלנו לאנשים עם מוגבלות על מנת לקדם שוויון זכויות ושקיפות כלפי אנשים עם מוגבלות.<br />
                    <h4>מהות אתר נגיש :</h4>
                    אתר נגיש הינו אתר המאפשר לאדם עם מוגבלות ,לגלוש באותה רמת יעילות והנאה כגולשים אחרים ,תוך שימוש ביכולות המערכת ובאמצעות טכנולוגיות מסייעות לנגישות.<br />
                    <br />
                    ביצוע התאמות הנגישות בפורטל התאמות הנגישות באתר בוצעו בהתאם ל:<br />
                    1.	תקנה 35 בתקנות שוויון זכויות לאנשים עם מוגבלות (התאמות נגישות לשירות התשע"ג - 2013).<br />
                    2.	לתקן הישראלי ת"י 5568 – "קווים מנחים לנגישות תכנים באינטרנט" לרמה . AA תקן ישראלי זה זהה למסמך הקווים המנחים של קונסורציום הרשת הכלל עולמית W3C  ובכפוף לשינויים והתאמות שבוצעו במסמך התקן הישראלי.<br />
                    <br />
                    עצם היות אתר זה נגיש, צוין במקום בולט בתפריט הראשי.
                </p>

                <h3> הנגשת האתר מותאמת לדפדפנים המובילים: </h3>
                <ul>
                    <li>Internet Explorer 9/10/11</li>
                    <li>Chrome</li>
                    <li>Firefox</li>
                    <li>Safari</li>
                </ul>


                <h3> כיצד עובדת ההנגשה באתר?</h3>

                האתר בנוי בהתאם לסטאנדרט נגישות, ונבדק על ידי תוספים מתאימים לבחינת בהירות וכלמנטים מתאימים לניווט באמצעות קוראי טקסט


                <h3> אמצעי הנגישות באתר: </h3>
                <ul>
                    <li>ניגודיות כהה ובהירה </li>
                    <li>התאמה לעיוורי צבעים </li>
                    <li>הדגשת כותרות </li>
                    <li>הדגשת קישורים </li>
                    <li>חלופה טקסטואלית לאובייקטים גרפיים (ALT) </li>
                    <li>העובדים עוברים הדרכות ייעודיות לשירות נגיש. </li>
                </ul>

                <h3> בעיות ותכנים לא נגישים</h3>
                כרגע לא ידועות בעיות נגישות באתר. נתקלתם בבעיה? ספרו לנו! אנחנו משתדלים לשמור ולתחזק את האתר ברמה הטובה ביותר. כדי שנוכל לטפל בבעיה בדרך הטובה ביותר, בבקשה צרפו פרטים מלאים ככל שניתן לתיאור הבעיה. מהי הפעולה שניסיתם לבצע? באיזה דף גלשתם? סוג וגרסה של הדפדפן. מערכת הפעלה. סוג הטכנולוגיה המסייעת וכדומה.<br />
                <h3> דרכי התקשרות</h3>
                ניתן לפנות אלינו באמצעות מרכז השירות לקוחות בטלפון 052-607-9419,  או באמצעות דואר אלקטרוני  <a href="mailto:tal.yaron@freedi.co" target='_blank'><span>tal.yaron@freedi.co</span></a>.<br />
                

                <br />
                <br />

                הצהרת נגישות זו עודכנה לאחרונה בתאריך 20/01/2025. <br />
                <br />
                <button onClick={close}>סגירה</button>
            </section>
        </div>
    )
}

export default AccessabilityStatement